Revit 2024 API
ExternalServices.BuiltInExternalServices.DirectContext3DService Property
 The external service that provides the facility to draw externally specified geometry in a Revit view in a way that is conceptually similar to a low-level graphics API. To use this service, programmers implement a server class that derives from Autodesk::Revit::DB::DirectContext3D::IDirectContext3DServer.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ExternalServiceId DirectContext3DService { get; }
Visual Basic
Public Shared ReadOnly Property DirectContext3DService As ExternalServiceId
	Get
Visual C++
public:
static property ExternalServiceId^ DirectContext3DService {
	ExternalServiceId^ get ();
}
See Also
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace